app/controllers/answer_controller.rb

  def index
    @questions = Question.where(status: 'waiting')
---
SELECT "questions".* FROM "questions" WHERE "questions"."status" = $1  [["status", "waiting"]]

  def create
    question = Question.find(params[:question][:question_id])
    question.answer = params[:question][:answer]
    if question.save
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
UPDATE "questions" SET "answer" = $1, "status" = $2, "updated_at" = $3 WHERE "questions"."id" = $4  [["answer", "Никак. Это ещё не реализованно."], ["status", "answered"], ["updated_at", "2022-02-19 21:47:57.179341"], ["id", 19]]