app/controllers/pages_controller.rb

  def destroy
    @review = Review.find(params[:id])
    if  @review.destroy
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 7]]

  def new_review
    review = Review.new(mark: cookies[:rating], comment: params[:review][0])
    review.user = current_user
    if review.save
---
INSERT INTO "reviews" ("mark", "comment", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["mark", 4], ["comment", "gdgdfgdfgd"], ["user_id", 1], ["created_at", "2022-02-16 20:03:40.734846"], ["updated_at", "2022-02-16 20:03:40.734846"]]