app/controllers/pages_controller.rb

  def destroy_question
    @question = Question.find(params[:id])
    unless @question.user==current_user
      flash[:alert] = "Что-бы удалить вопрос, вы должны быть его автором"
      return
    end
    if @question.destroy
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 12]]

  def questions
    @questions = Question.where(status: 'answered', user_id: current_user.id)
---
SELECT "questions".* FROM "questions" WHERE "questions"."status" = $1 AND "questions"."user_id" = $2  [["status", "answered"], ["user_id", 3]]

  def contacts_send
    @question = Question.new(question_params)
    @question.status = "waiting"
    @question.user = current_user
    if @question.save
---
INSERT INTO "questions" ("body", "status", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "аыаываыаыаыаыавы"], ["status", "waiting"], ["user_id", 3], ["created_at", "2022-02-18 19:28:34.471010"], ["updated_at", "2022-02-18 19:28:34.471010"]]

  def reviews
    @reviews = Review.paginate(page: params[:page], per_page: 10)
---
SELECT  "reviews".* FROM "reviews" LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "reviews"

  def destroy
    @review = Review.find(params[:id])
    if @review.destroy
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 1]]

  def new_review
    review = Review.new(mark: cookies[:rating], comment: params[:review][0])
    review.user = current_user
    if review.save
---
INSERT INTO "reviews" ("mark", "comment", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["mark", 3], ["comment", "аываываываываываываываыва"], ["user_id", 1], ["created_at", "2022-02-20 17:06:29.697746"], ["updated_at", "2022-02-20 17:06:29.697746"]]