app/controllers/profile_controller.rb

  def edit
    user_exist
    @user = current_user
    if params[:user][:password] == params[:user][:password_confirmation] && current_user.update(user_params)
---
UPDATE "users" SET "encrypted_password" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["encrypted_password", "$2a$12$xtX2MQ1CeVfmNzuHn79ZhuEH/Mdb1GpNMBvQyrE0/ZksLekhOPUVG"], ["updated_at", "2022-02-16 19:26:51.301827"], ["id", 1]]