app/controllers/service_controller.rb

UPDATE "services" SET "updated_at" = $1 WHERE "services"."id" = $2  [["updated_at", "2022-02-20 18:58:12.785751"], ["id", 15]]
---
  def update
    @service = Service.find(params[:id])
    @service.image=params[:service]["Загрузить фото"] if params[:service]["Загрузить фото"]
    if @service.update_attributes(service_params)