app/controllers/service_controller.rb

SELECT  "services".* FROM "services" LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "services"
---
  def index
    @services = Service.paginate(:page => params[:page], :per_page => 9)

SELECT  "services".* FROM "services" WHERE "services"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "services" WHERE "services"."id" = $1  [["id", 6]]
---
  def destroy
    service = Service.find(params[:id])
    if service.destroy

INSERT INTO "services" ("name", "description", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "аываываыв"], ["description", "ываываыва"], ["price", 123], ["created_at", "2022-02-20 18:57:48.967058"], ["updated_at", "2022-02-20 18:57:48.967058"]]
---
  def create
    @service = Service.new(service_params)
    @service.image=params[:service]["Загрузить фото"] if params[:service]["Загрузить фото"]
    if @service.save